Repository: Zemchonak/diploma_webapi
Catalog: src/FitnessCenterManagement.BusinessLogic/Resources/StringRes.*.resx
Languages: ru_ru

# DateInThePastMsg
source: Date cannot be in the past!
ru_ru: Дата не может быть в прошлом!

# EmptyDescriptionMsg
source: Description cannot be null!
ru_ru: Описание не может быть пустым!

# EmptyNameMsg
source: Name cannot be null!
ru_ru: Имя не может быть пустым!

# NameShouldBeUniqueMsg
source: Name should be unique!
ru_ru: Имя должно быть уникальным!

# NotFoundMsg
source: Not found!
ru_ru: Не найдено!

# NullEntityMsg
source: Entity cannot be null!
ru_ru: Сущность не может быть пустой!

# OperateOnNullEntityMsg
source: Cannot operate on null entity!
ru_ru: Невозможно проводить операции над пустой сущностью!

# EmailIsTakenMsg
source: The specified Email is already taken!
ru_ru: Данный email уже занят!

# InvalidProfileInfoMsg
source: Invalid profile info!
ru_ru: Профиль содержит некорректную информацию!

# NegativeAttendancesMsg
source: The amount of attendances should be above 0!
ru_ru: Число посещений должно быть больше 0!

# NegativeCostMsg
source: The cost should be more or equal 0!
ru_ru: Стоимость должна быть больше либо 0!

# NegativeDaysMsg
source: The amount of days should be above 0!
ru_ru: Число дней должно быть больше 0!

# NegativeStopDaysMsg
source: The amount of days for stop should be more or equal 0!
ru_ru: Число дней для остановки должно быть больше либо 0!

# NegativeVisitsCountMsg
source: The visits count should be more or equal 0!
ru_ru: Число посещений должно быть больше либо 0!

# VisitsMoreThanAbonementAttendancesMsg
source: The amount of visits should be less than the one provided by the abonement!
ru_ru: Число посещений должно быть не больше чем то, что предусмотрено абнонементом!

# MaximumMinutesMsg
source: The length of the meeting should be above less or 180!
ru_ru: Продолжительность занятия должна быть меньше или 180 минут!

# NotUniqueAddressNameMsg
source: A venue should have a unique name for the address!
ru_ru: Место проведения занятий должно иметь уникальное имя в указанном адресе!

# NegativeBalance
source: Your balance can't be less than 0!
ru_ru: Баланс не может быть ниже 0!

# UniqueNameForSpecialization
source: Service should have a unique name for its specialization!
ru_ru: Сервис должен иметь уникальное имя для специализации!

# NegativePriceMsg
source: The price should be above or equal 0!
ru_ru: Цена должна быть больше либо 0!

# NegativeMinutesMsg
source: The length of the meeting should be above 0!
ru_ru: Продолжительность занятия должна быть больше 0!

# CoefficientBoundsMsg
source: The coefficient should be between 0 and 2!
ru_ru: Коэффициент должен быть между 0 и 2!

# NullTextMsg
source: Text cannot be empty!
ru_ru: Текст не может быть пустым!

# DateInTheFutureMsg
source: Date cannot be in the future!
ru_ru: Дата не может быть в будущем!

# AlreadyExistsMsg
source: Already exists!
ru_ru: Уже существует!

# IncorrectDayOfWeekMsg
source: The day is not correct!
ru_ru: Некорректный день!

# MinVisitorCapacityMsg
source: Visitor capacity should be above 0!
ru_ru: Количество посетителей должно быть больше 0!

# TimeCrossesMsg
source: The time you've chosen is already taken
ru_ru: Время, выбранное вами, уже занято

# WrongDayOfWeekMsg
source: The day you've chosen is not the one defined by the weekly event
ru_ru: День, который вы выбрали, не тот, который определён еженедельным занятием

# EmptyInfoMsg
source: Info cannot be null!
ru_ru: Информация не может быть пустым!

# EmptyAddressMsg
source: Address cannot be null!
ru_ru: Адрес не может быть пустым!
